# Учебный проект для Skypro для банковской фитчи

## Описание
Проект создан на языке Python в среде PyCharm использованием менеджера пакетов Poetry в соответствии с учебной задачей Skypro с образовательной целью

## Установка
1. Установите PyCharm c официального сайта JETBRAINS [Ссылка на сайт](https://www.jetbrains.com/pycharm/.)
2. Установите менеджер пакетов Poetry [Ссылка тут]( https://python-poetry.org/)
3. В PyCharm склонируйте репозиторий с ссылкой https://github.com/VasiliyMikhaylov91/new_bank_widget.git
4. Установите интерпретатор Python Poetry
5. Установите необходимые зависимости описанные в файле pyproject.toml

## Описание функций
Основные функции находятся в пакете src

В модуле widget:
- Функция mask_account_card принимает тип карты с номером или счет и маскирует их номера
```commandline
# Пример для карты
Visa Platinum 7000792289606361  # входной аргумент
Visa Platinum 7000 79** **** 6361  # выход функции

# Пример для счета
Счет 73654108430135874305  # входной аргумент
Счет **4305  # выход функции
```
- Функция get_date извлекает дату в формате "ДД.ММ.ГГГГ" из времени в формате "2024-03-11T02:26:18.671407"

В модуле processing:
- Функция filter_by_state которая принимает список словарей и опционально значение для ключа state (по умолчанию 'EXECUTED'). Функция возвращает новый список словарей, содержащий только те словари, у которых ключ state соответствует указанному значению.
#### Пример работы функции
```commandline
# Выход функции со статусом по умолчанию 'EXECUTED'
[{'id': 41428829, 'state': 'EXECUTED', 'date': '2019-07-03T18:35:29.512364'}, {'id': 939719570, 'state': 'EXECUTED', 'date': '2018-06-30T02:08:58.425572'}]

# Выход функции, если вторым аргументов передано 'CANCELED'
[{'id': 594226727, 'state': 'CANCELED', 'date': '2018-09-12T21:27:25.241689'}, {'id': 615064591, 'state': 'CANCELED', 'date': '2018-10-14T08:21:33.419441'}]
```
- Функция sort_by_date принимает список словарей и необязательный параметр, задающий порядок сортировки (по умолчанию — убывание). Функция возвращатьет новый список, отсортированный по дате
#### Пример работы функции
```commandline
#Входные данные
[{'id': 41428829, 'state': 'EXECUTED', 'date': '2019-07-03T18:35:29.512364'}, {'id': 939719570, 'state': 'EXECUTED', 'date': '2018-06-30T02:08:58.425572'}, {'id': 594226727, 'state': 'CANCELED', 'date': '2018-09-12T21:27:25.241689'}, {'id': 615064591, 'state': 'CANCELED', 'date': '2018-10-14T08:21:33.419441'}]

# Выход функции (сортировка по убыванию, т. е. сначала самые последние операции)
[{'id': 41428829, 'state': 'EXECUTED', 'date': '2019-07-03T18:35:29.512364'}, {'id': 615064591, 'state': 'CANCELED', 'date': '2018-10-14T08:21:33.419441'}, {'id': 594226727, 'state': 'CANCELED', 'date': '2018-09-12T21:27:25.241689'}, {'id': 939719570, 'state': 'EXECUTED', 'date': '2018-06-30T02:08:58.425572'}]
```

В модуле generators:
- Функция filter_by_currency принимает на вход список словарей, представляющих транзакции и возвращает итератор, который поочередно выдает транзакции, где валюта операции соответствует заданной.
#### Пример использования функции
```commandline
usd_transactions = filter_by_currency(transactions, "USD")
for _ in range(2):
    print(next(usd_transactions))

>>> {
          "id": 939719570,
          "state": "EXECUTED",
          "date": "2018-06-30T02:08:58.425572",
          "operationAmount": {
              "amount": "9824.07",
              "currency": {
                  "name": "USD",
                  "code": "USD"
              }
          },
          "description": "Перевод организации",
          "from": "Счет 75106830613657916952",
          "to": "Счет 11776614605963066702"
      }
      {
              "id": 142264268,
              "state": "EXECUTED",
              "date": "2019-04-04T23:20:05.206878",
              "operationAmount": {
                  "amount": "79114.93",
                  "currency": {
                      "name": "USD",
                      "code": "USD"
                  }
              },
              "description": "Перевод со счета на счет",
              "from": "Счет 19708645243227258542",
              "to": "Счет 75651667383060284188"
       }
```
- Функция генератор transaction_descriptions принимает список словарей с транзакциями и возвращает описание каждой операции по очереди.
#### Пример использования функции
```commandline
descriptions = transaction_descriptions(transactions)
for _ in range(5):
    print(next(descriptions))

>>> Перевод организации
    Перевод со счета на счет
    Перевод со счета на счет
    Перевод с карты на карту
    Перевод организации
```
- Функция генератор card_number_generator
, который выдает номера банковских карт в формате 
XXXX XXXX XXXX XXXX
, где 
X
 — цифра номера карты. Генератор может сгенерировать номера карт в заданном диапазоне от 0000 0000 0000 0001 до 9999 9999 9999 9999.
Генератор принимает начальное и конечное значения для генерации диапазона номеров.
#### Пример использования функции
```commandline
for card_number in card_number_generator(1, 5):
    print(card_number)

>>> 0000 0000 0000 0001
    0000 0000 0000 0002
    0000 0000 0000 0003
    0000 0000 0000 0004
    0000 0000 0000 0005
```
## Тестирование функций
Тестирование функций производится в модулях test_masks.py test_processing.py test_widget.py пакета tests.

- Протестировать все функции целиком возможно из контекстного меню пакета tests.
- Отдельные функции пакета src возможно протестировать из соответствующих модулей пакета tests.

Дополнительные кейсы для тестирования функций следует писать в соответствующих модулях пакета tests.